<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DepartmentTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        try {
            $query = "INSERT INTO `department` (`id`, `name`, `college`) VALUES
            (1, '中文系', '文學院'),
            (2, '外文系', '文學院'),
            (3, '數學系', '理學院'),
            (4, '台文系', '文學院'),
            (5, '物理系', '理學院'),
            (6, '化學系', '理學院'),
            (7, '地科系', '理學院'),
            (8, '光電系', '理學院'),
            (9, '機械系', '工學院'),
            (10, '化工系', '工學院'),
            (11, '材料系', '工學院'),
            (12, '資源系', '工學院'),
            (13, '土木系', '工學院'),
            (14, '水利系', '工學院'),
            (15, '工科系', '工學院'),
            (16, '系統系', '工學院'),
            (17, '航太系', '工學院'),
            (18, '環工系', '工學院'),
            (19, '測量系', '工學院'),
            (20, '醫工系', '工學院'),
            (21, '能源學程', '工學院'),
            (22, '工資系', '管理學院'),
            (23, '交管系', '管理學院'),
            (24, '企管系', '管理學院'),
            (25, '統計系', '管理學院'),
            (26, '會計系', '管理學院'),
            (27, '醫學系', '醫學院'),
            (28, '牙醫系', '醫學院'),
            (29, '醫技系', '醫學院'),
            (30, '護理系', '醫學院'),
            (31, '職治系', '醫學院'),
            (32, '物治系', '醫學院'),
            (33, '藥學系', '醫學院'),
            (34, '政治系', '社會科學院'),
            (35, '經濟系', '社會科學院'),
            (36, '法律系', '社會科學院'),
            (37, '心理系', '社會科學院'),
            (38, '電機系', '電資學院'),
            (39, '資訊系', '電資學院'),
            (40, '建築系', '規設院'),
            (41, '都計系', '規設院'),
            (42, '工設系', '規設院'),
            (43, '生科系', '生科院'),
            (44, '生技系', '生科院'),
            (45, '不分系', '其他'),
            (46, '歷史系', '文學院');";

            DB::insert($query) or die('MySQL query error');
            
        } catch(Exception $e){
            error_log($e->getMessage());
        }
    }
}
